### Food Delivery Data Analytics using Pandas

| Source             | Data                 | Format |
| ------------------ | -------------------- | ------ |
| Order transactions | Order details        | MySQL  |
| Customer master    | Customer profile     | CSV    |
| Restaurant master  | Restaurant details   | Excel  |

#### Customer Data

In [1]:
import pandas as pd

customers_df = pd.read_csv("data/fd/bronze/customer_raw.csv")
print(customers_df.head())

   customer_id first_name last_name                   email       phone  \
0          101      rahul    sharma  rahul.sharma@email.com  9876543210
1          102      PRIYA     Verma   priya.verma@email.com  9876543211
2          103       Amit       NaN              amit@email       98765
3          104      Sneha  Kulkarni                     NaN  9876543213
4          105        Raj     Patel     raj.patel@email.com         NaN

        city registration_date    status
0     Mumbai        2023-01-12    Active
1      Delhi        2023-02-15    Active
2       Pune        2023-03-20    Active
3  Bangalore        2026-01-10    Active
4  Ahmedabad        2023-04-18  Inactive

In [2]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        10 non-null     int64
 1   first_name         9 non-null      object
 2   last_name          9 non-null      object
 3   email              9 non-null      object
 4   phone              9 non-null      object
 5   city               9 non-null      object
 6   registration_date  9 non-null      object
 7   status             10 non-null     object
dtypes: int64(1), object(7)
memory usage: 772.0+ bytes

Data Quality Checks

In [3]:
# Check for missing value
customers_df.isnull().sum()

customer_id          0
first_name           1
last_name            1
email                1
phone                1
city                 1
registration_date    1
status               0
dtype: int64

In [4]:
# Check for duplicate
customers_df.duplicated().sum()

np.int64(0)

In [5]:
# Check for duplicate OR based on business key:
customers_df.duplicated(subset=['email']).sum()

np.int64(1)

In [6]:
customers_df

,customer_id,first_name,last_name,email,phone,city,registration_date,status
0,101,rahul,sharma,rahul.sharma@email.com,9876543210,Mumbai,2023-01-12,Active
1,102,PRIYA,Verma,priya.verma@email.com,9876543211,Delhi,2023-02-15,Active
2,103,Amit,NaN,amit@email,98765,Pune,2023-03-20,Active
3,104,Sneha,Kulkarni,NaN,9876543213,Bangalore,2026-01-10,Active
4,105,Raj,Patel,raj.patel@email.com,NaN,Ahmedabad,2023-04-18,Inactive
5,106,Anjali,Mehta,anjali.mehta@email.com,9876543215,Mumbai,NaN,Active
6,107,rahul,sharma,rahul.sharma@email.com,9876543210,Mumbai,2023-01-12,Active
7,108,Karan,Singh,karan.singh@email,9876543217,NaN,2023-05-10,Active
8,109,Meera,Rao,meera.rao@email.com,abc123,Pune,2023-06-05,Active
9,110,NaN,Kapoor,kapoor@email.com,9876543219,Delhi,2023-07-01,Active

Data Cleaning Steps

In [7]:
# Remove duplicate
customers_df.drop_duplicates('email',inplace=True)
customers_df

,customer_id,first_name,last_name,email,phone,city,registration_date,status
0,101,rahul,sharma,rahul.sharma@email.com,9876543210,Mumbai,2023-01-12,Active
1,102,PRIYA,Verma,priya.verma@email.com,9876543211,Delhi,2023-02-15,Active
2,103,Amit,NaN,amit@email,98765,Pune,2023-03-20,Active
3,104,Sneha,Kulkarni,NaN,9876543213,Bangalore,2026-01-10,Active
4,105,Raj,Patel,raj.patel@email.com,NaN,Ahmedabad,2023-04-18,Inactive
5,106,Anjali,Mehta,anjali.mehta@email.com,9876543215,Mumbai,NaN,Active
7,108,Karan,Singh,karan.singh@email,9876543217,NaN,2023-05-10,Active
8,109,Meera,Rao,meera.rao@email.com,abc123,Pune,2023-06-05,Active
9,110,NaN,Kapoor,kapoor@email.com,9876543219,Delhi,2023-07-01,Active

In [8]:
# Standardize Text Columns
customers_df['first_name'] = customers_df['first_name'].str.title()
customers_df['last_name'] = customers_df['last_name'].str.title()
customers_df['city'] = customers_df['city'].str.title()
customers_df['status'] = customers_df['status'].str.upper()
customers_df

,customer_id,first_name,last_name,email,phone,city,registration_date,status
0,101,Rahul,Sharma,rahul.sharma@email.com,9876543210,Mumbai,2023-01-12,ACTIVE
1,102,Priya,Verma,priya.verma@email.com,9876543211,Delhi,2023-02-15,ACTIVE
2,103,Amit,NaN,amit@email,98765,Pune,2023-03-20,ACTIVE
3,104,Sneha,Kulkarni,NaN,9876543213,Bangalore,2026-01-10,ACTIVE
4,105,Raj,Patel,raj.patel@email.com,NaN,Ahmedabad,2023-04-18,INACTIVE
5,106,Anjali,Mehta,anjali.mehta@email.com,9876543215,Mumbai,NaN,ACTIVE
7,108,Karan,Singh,karan.singh@email,9876543217,NaN,2023-05-10,ACTIVE
8,109,Meera,Rao,meera.rao@email.com,abc123,Pune,2023-06-05,ACTIVE
9,110,NaN,Kapoor,kapoor@email.com,9876543219,Delhi,2023-07-01,ACTIVE

In [9]:
# Fix Missing Names
customers_df['first_name'] = customers_df['first_name'].fillna("Unknown")
customers_df['last_name'] = customers_df['last_name'].fillna("Unknown")
customers_df

,customer_id,first_name,last_name,email,phone,city,registration_date,status
0,101,Rahul,Sharma,rahul.sharma@email.com,9876543210,Mumbai,2023-01-12,ACTIVE
1,102,Priya,Verma,priya.verma@email.com,9876543211,Delhi,2023-02-15,ACTIVE
2,103,Amit,Unknown,amit@email,98765,Pune,2023-03-20,ACTIVE
3,104,Sneha,Kulkarni,NaN,9876543213,Bangalore,2026-01-10,ACTIVE
4,105,Raj,Patel,raj.patel@email.com,NaN,Ahmedabad,2023-04-18,INACTIVE
5,106,Anjali,Mehta,anjali.mehta@email.com,9876543215,Mumbai,NaN,ACTIVE
7,108,Karan,Singh,karan.singh@email,9876543217,NaN,2023-05-10,ACTIVE
8,109,Meera,Rao,meera.rao@email.com,abc123,Pune,2023-06-05,ACTIVE
9,110,Unknown,Kapoor,kapoor@email.com,9876543219,Delhi,2023-07-01,ACTIVE

Replace Invalid Phones with NaN

In [11]:
invalid_phone_mask = ~customers_df['phone'].astype(str).str.match(r'^\d{10}$')

In [12]:
import numpy as np
customers_df.loc[invalid_phone_mask, 'phone'] = np.nan
customers_df

,customer_id,first_name,last_name,email,phone,city,registration_date,status
0,101,Rahul,Sharma,rahul.sharma@email.com,9876543210,Mumbai,2023-01-12,ACTIVE
1,102,Priya,Verma,priya.verma@email.com,9876543211,Delhi,2023-02-15,ACTIVE
2,103,Amit,Unknown,amit@email,NaN,Pune,2023-03-20,ACTIVE
3,104,Sneha,Kulkarni,NaN,9876543213,Bangalore,2026-01-10,ACTIVE
4,105,Raj,Patel,raj.patel@email.com,NaN,Ahmedabad,2023-04-18,INACTIVE
5,106,Anjali,Mehta,anjali.mehta@email.com,9876543215,Mumbai,NaN,ACTIVE
7,108,Karan,Singh,karan.singh@email,9876543217,NaN,2023-05-10,ACTIVE
8,109,Meera,Rao,meera.rao@email.com,NaN,Pune,2023-06-05,ACTIVE
9,110,Unknown,Kapoor,kapoor@email.com,9876543219,Delhi,2023-07-01,ACTIVE

In [13]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 0 to 9
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        9 non-null      int64
 1   first_name         9 non-null      object
 2   last_name          9 non-null      object
 3   email              8 non-null      object
 4   phone              6 non-null      object
 5   city               8 non-null      object
 6   registration_date  8 non-null      object
 7   status             9 non-null      object
dtypes: int64(1), object(7)
memory usage: 648.0+ bytes

Remove Future Registration Dates

In [14]:
customers_df['registration_date'] = pd.to_datetime(customers_df['registration_date'], errors='coerce')
customers_df[customers_df['registration_date'] > pd.Timestamp.today()]

Empty DataFrame
Columns: [customer_id, first_name, last_name, email, phone, city, registration_date, status]
Index: []

In [15]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 0 to 9
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        9 non-null      int64
 1   first_name         9 non-null      object
 2   last_name          9 non-null      object
 3   email              8 non-null      object
 4   phone              6 non-null      object
 5   city               8 non-null      object
 6   registration_date  8 non-null      datetime64[ns]
 7   status             9 non-null      object
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 648.0+ bytes

Clean & Standardize Email Column

In [16]:
# Convert to lowercase
customers_df['email'] = customers_df['email'].str.lower()

In [17]:
def clean_email(email):
    if pd.isna(email):
        return np.nan
    
    email = email.strip().lower()
    
    # Must contain '@'
    if '@' not in email:
        return np.nan
    
    # If .com missing but structure looks valid
    if '.com' not in email:
        email = email + '.com'
    
    # Final validation check
    import re
    pattern = r'^[\w\.-]+@[\w\.-]+\.com$'
    
    if re.match(pattern, email):
        return email
    else:
        return np.nan

customers_df['email'] = customers_df['email'].apply(clean_email)

In [18]:
customers_df

,customer_id,first_name,last_name,email,phone,city,registration_date,status
0,101,Rahul,Sharma,rahul.sharma@email.com,9876543210,Mumbai,2023-01-12,ACTIVE
1,102,Priya,Verma,priya.verma@email.com,9876543211,Delhi,2023-02-15,ACTIVE
2,103,Amit,Unknown,amit@email.com,NaN,Pune,2023-03-20,ACTIVE
3,104,Sneha,Kulkarni,NaN,9876543213,Bangalore,2026-01-10,ACTIVE
4,105,Raj,Patel,raj.patel@email.com,NaN,Ahmedabad,2023-04-18,INACTIVE
5,106,Anjali,Mehta,anjali.mehta@email.com,9876543215,Mumbai,NaT,ACTIVE
7,108,Karan,Singh,karan.singh@email.com,9876543217,NaN,2023-05-10,ACTIVE
8,109,Meera,Rao,meera.rao@email.com,NaN,Pune,2023-06-05,ACTIVE
9,110,Unknown,Kapoor,kapoor@email.com,9876543219,Delhi,2023-07-01,ACTIVE

Save Clean Data

In [19]:
import os

output_path = "data/fd/silver"

# Create directory if it doesn't exist
os.makedirs(output_path, exist_ok=True)

customers_df.to_csv(f"{output_path}/customer_clean.csv", index=False)

In [20]:
pd.read_csv(f"{output_path}/customer_clean.csv")

,customer_id,first_name,last_name,email,phone,city,registration_date,status
0,101,Rahul,Sharma,rahul.sharma@email.com,9.876543e+09,Mumbai,2023-01-12,ACTIVE
1,102,Priya,Verma,priya.verma@email.com,9.876543e+09,Delhi,2023-02-15,ACTIVE
2,103,Amit,Unknown,amit@email.com,NaN,Pune,2023-03-20,ACTIVE
3,104,Sneha,Kulkarni,NaN,9.876543e+09,Bangalore,2026-01-10,ACTIVE
4,105,Raj,Patel,raj.patel@email.com,NaN,Ahmedabad,2023-04-18,INACTIVE
5,106,Anjali,Mehta,anjali.mehta@email.com,9.876543e+09,Mumbai,NaN,ACTIVE
6,108,Karan,Singh,karan.singh@email.com,9.876543e+09,NaN,2023-05-10,ACTIVE
7,109,Meera,Rao,meera.rao@email.com,NaN,Pune,2023-06-05,ACTIVE
8,110,Unknown,Kapoor,kapoor@email.com,9.876543e+09,Delhi,2023-07-01,ACTIVE

#### Restaurant Master Data  Excel source

In [21]:
restaurants_df = pd.read_excel(
    "data/fd/bronze/restaurant_raw.xlsx",
    sheet_name="Sheet1"
)

print(restaurants_df.head())

   restaurant_id restaurant_name    city cuisine_type  rating is_active  \
0            201       spice hub  mumbai       Indian     4.5       Yes
1            202     Tasty Bites   Delhi      italian     5.2       Yes
2            203     Food Corner     NaN      Chinese     3.8       Yes
3            204       spice hub  Mumbai       Indian     4.5       Yes
4            205       Quick Eat    Pune          NaN    -1.0        No

  opening_date
0   2021-05-10
1   2022-01-15
2   2023-03-20
3   2021-05-10
4   2020-08-01

Data Quality Checks

In [22]:
# Missing value
restaurants_df.isnull().sum()

restaurant_id      0
restaurant_name    0
city               1
cuisine_type       1
rating             1
is_active          0
opening_date       0
dtype: int64

In [23]:
# Duplicate Check (Business Key)
restaurants_df.duplicated(subset=['restaurant_name', 'city']).sum()

np.int64(0)

In [24]:
# Rating must be between 1 and 5
restaurants_df[
    (restaurants_df['rating'] < 1) | 
    (restaurants_df['rating'] > 5)
]

,restaurant_id,restaurant_name,city,cuisine_type,rating,is_active,opening_date
1,202,Tasty Bites,Delhi,italian,5.2,Yes,2022-01-15
4,205,Quick Eat,Pune,NaN,-1.0,No,2020-08-01

In [25]:
# Future Opening Date Check
restaurants_df['opening_date'] = pd.to_datetime(
    restaurants_df['opening_date'],
    errors='coerce'
)

restaurants_df[restaurants_df['opening_date'] > pd.Timestamp.today()]

Empty DataFrame
Columns: [restaurant_id, restaurant_name, city, cuisine_type, rating, is_active, opening_date]
Index: []

In [26]:
# Active Flag Standardization Issue
restaurants_df['is_active'].unique()

array(['Yes', 'No', 'YES'], dtype=object)

Cleaning & Transformation

In [27]:
# Standardize Text Columns

restaurants_df['restaurant_name'] = restaurants_df['restaurant_name'].str.title()
restaurants_df['city'] = restaurants_df['city'].str.title()
restaurants_df['cuisine_type'] = restaurants_df['cuisine_type'].str.title()
restaurants_df

,restaurant_id,restaurant_name,city,cuisine_type,rating,is_active,opening_date
0,201,Spice Hub,Mumbai,Indian,4.5,Yes,2021-05-10
1,202,Tasty Bites,Delhi,Italian,5.2,Yes,2022-01-15
2,203,Food Corner,NaN,Chinese,3.8,Yes,2023-03-20
3,204,Spice Hub,Mumbai,Indian,4.5,Yes,2021-05-10
4,205,Quick Eat,Pune,NaN,-1.0,No,2020-08-01
5,206,Urban Grill,Bangalore,Continental,4.0,YES,2026-01-01
6,207,The Curry House,Delhi,Indian,NaN,No,2022-06-10
7,208,123Food,Pune,Fastfood,4.2,Yes,2021-11-25

In [28]:
# Standardize is_active Column
restaurants_df['is_active'] = restaurants_df['is_active'].apply(str.upper)
restaurants_df

,restaurant_id,restaurant_name,city,cuisine_type,rating,is_active,opening_date
0,201,Spice Hub,Mumbai,Indian,4.5,YES,2021-05-10
1,202,Tasty Bites,Delhi,Italian,5.2,YES,2022-01-15
2,203,Food Corner,NaN,Chinese,3.8,YES,2023-03-20
3,204,Spice Hub,Mumbai,Indian,4.5,YES,2021-05-10
4,205,Quick Eat,Pune,NaN,-1.0,NO,2020-08-01
5,206,Urban Grill,Bangalore,Continental,4.0,YES,2026-01-01
6,207,The Curry House,Delhi,Indian,NaN,NO,2022-06-10
7,208,123Food,Pune,Fastfood,4.2,YES,2021-11-25

In [29]:
# Handle Invalid Ratings

restaurants_df.loc[
    (restaurants_df['rating'] < 1) | 
    (restaurants_df['rating'] > 5),
    'rating'
] = pd.NA

restaurants_df

,restaurant_id,restaurant_name,city,cuisine_type,rating,is_active,opening_date
0,201,Spice Hub,Mumbai,Indian,4.5,YES,2021-05-10
1,202,Tasty Bites,Delhi,Italian,NaN,YES,2022-01-15
2,203,Food Corner,NaN,Chinese,3.8,YES,2023-03-20
3,204,Spice Hub,Mumbai,Indian,4.5,YES,2021-05-10
4,205,Quick Eat,Pune,NaN,NaN,NO,2020-08-01
5,206,Urban Grill,Bangalore,Continental,4.0,YES,2026-01-01
6,207,The Curry House,Delhi,Indian,NaN,NO,2022-06-10
7,208,123Food,Pune,Fastfood,4.2,YES,2021-11-25

In [30]:
# Replace Missing Cuisine with "Unknown"
restaurants_df.fillna({'cuisine_type': 'Unknown'}, inplace=True)
restaurants_df

,restaurant_id,restaurant_name,city,cuisine_type,rating,is_active,opening_date
0,201,Spice Hub,Mumbai,Indian,4.5,YES,2021-05-10
1,202,Tasty Bites,Delhi,Italian,NaN,YES,2022-01-15
2,203,Food Corner,NaN,Chinese,3.8,YES,2023-03-20
3,204,Spice Hub,Mumbai,Indian,4.5,YES,2021-05-10
4,205,Quick Eat,Pune,Unknown,NaN,NO,2020-08-01
5,206,Urban Grill,Bangalore,Continental,4.0,YES,2026-01-01
6,207,The Curry House,Delhi,Indian,NaN,NO,2022-06-10
7,208,123Food,Pune,Fastfood,4.2,YES,2021-11-25

In [31]:
# Remove Exact Duplicates
restaurants_df = restaurants_df.drop_duplicates(['restaurant_name', 'city'])
restaurants_df

,restaurant_id,restaurant_name,city,cuisine_type,rating,is_active,opening_date
0,201,Spice Hub,Mumbai,Indian,4.5,YES,2021-05-10
1,202,Tasty Bites,Delhi,Italian,NaN,YES,2022-01-15
2,203,Food Corner,NaN,Chinese,3.8,YES,2023-03-20
4,205,Quick Eat,Pune,Unknown,NaN,NO,2020-08-01
5,206,Urban Grill,Bangalore,Continental,4.0,YES,2026-01-01
6,207,The Curry House,Delhi,Indian,NaN,NO,2022-06-10
7,208,123Food,Pune,Fastfood,4.2,YES,2021-11-25

Save Cleaned Data to Silver

In [32]:
from pathlib import Path

silver_path = Path("data/fd/silver")
silver_path.mkdir(parents=True, exist_ok=True)

restaurants_df.to_csv(silver_path / "restaurant_clean.csv", index=False)

In [33]:
pd.read_csv(silver_path / "restaurant_clean.csv")

,restaurant_id,restaurant_name,city,cuisine_type,rating,is_active,opening_date
0,201,Spice Hub,Mumbai,Indian,4.5,YES,2021-05-10
1,202,Tasty Bites,Delhi,Italian,NaN,YES,2022-01-15
2,203,Food Corner,NaN,Chinese,3.8,YES,2023-03-20
3,205,Quick Eat,Pune,Unknown,NaN,NO,2020-08-01
4,206,Urban Grill,Bangalore,Continental,4.0,YES,2026-01-01
5,207,The Curry House,Delhi,Indian,NaN,NO,2022-06-10
6,208,123Food,Pune,Fastfood,4.2,YES,2021-11-25

#### Business Context  Orders Data

Orders table contains:

- order_id
- customer_id
- restaurant_id
- order_amount
- order_status
- payment_method
- order_date
- delivery_time_minutes

Load from MySQL into Pandas

In [35]:
def ingest_mysql_data(sql):

    from sqlalchemy import create_engine

    oltp_con = create_engine("mysql+mysqlconnector://root:password@localhost/food_delivery")
    orders_df = pd.read_sql(sql, oltp_con)

    # Store Raw Data in Bronze Layer (JSON)
    from pathlib import Path

    bronze_path = Path("data/fd/bronze")
    bronze_path.mkdir(parents=True, exist_ok=True)

    orders_df.to_json(
        bronze_path / "orders_raw.json",
        orient="records",
        indent=4
    )

    return bronze_path / "orders_raw.json"

In [36]:
sql = "SELECT * FROM orders"
path = ingest_mysql_data(sql)
orders_df = pd.read_json(path)
orders_df.head(10)

,order_id,customer_id,restaurant_id,order_amount,order_status,payment_method,order_date,delivery_time_minutes
0,1001,101,201,850,Completed,UPI,1694304000000,35.0
1,1002,102,202,-500,completed,Card,1694476800000,40.0
2,1003,103,203,0,cancel,Cash,1694736000000,NaN
3,1004,104,204,1200,done,UPI,1767225600000,50.0
4,1005,105,205,650,Cancelled,Card,1696118400000,20.0
5,1006,106,206,950,Completed,UPI,1696464000000,200.0
6,1007,107,207,720,COMPLETED,Wallet,1696723200000,30.0
7,1008,108,208,1100,invalid_status,UPI,1696896000000,45.0
8,1001,101,201,850,Completed,UPI,1694304000000,35.0
9,1009,109,201,450,Completed,UPI,1696982400000,25.0

In [37]:
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   order_id               29 non-null     int64
 1   customer_id            29 non-null     int64
 2   restaurant_id          29 non-null     int64
 3   order_amount           29 non-null     int64
 4   order_status           29 non-null     object
 5   payment_method         29 non-null     object
 6   order_date             29 non-null     int64
 7   delivery_time_minutes  27 non-null     float64
dtypes: float64(1), int64(5), object(2)
memory usage: 1.9+ KB

Data Quality Checks

In [38]:
# Check Invalid Amount
orders_df[orders_df['order_amount'] <= 0]

,order_id,customer_id,restaurant_id,order_amount,order_status,payment_method,order_date,delivery_time_minutes
1,1002,102,202,-500,completed,Card,1694476800000,40.0
2,1003,103,203,0,cancel,Cash,1694736000000,NaN
12,1012,102,204,-300,done,Cash,1697241600000,40.0
14,1014,104,206,0,cancel,Card,1697414400000,35.0
23,1023,103,207,-50,cancel,UPI,1698192000000,25.0

In [39]:
# Standardize order_status
orders_df['order_status'].unique()

array(['Completed', 'completed', 'cancel', 'done', 'Cancelled',
       'COMPLETED', 'invalid_status', 'invalid'], dtype=object)

In [40]:
# Format order date
orders_df['order_date'] = pd.to_datetime(
    orders_df['order_date'],
    unit='ms',
    errors='coerce'
)

orders_df.head()

,order_id,customer_id,restaurant_id,order_amount,order_status,payment_method,order_date,delivery_time_minutes
0,1001,101,201,850,Completed,UPI,2023-09-10,35.0
1,1002,102,202,-500,completed,Card,2023-09-12,40.0
2,1003,103,203,0,cancel,Cash,2023-09-15,NaN
3,1004,104,204,1200,done,UPI,2026-01-01,50.0
4,1005,105,205,650,Cancelled,Card,2023-10-01,20.0

In [41]:
# Future Date Check
orders_df[orders_df['order_date'] > pd.Timestamp.today()]

Empty DataFrame
Columns: [order_id, customer_id, restaurant_id, order_amount, order_status, payment_method, order_date, delivery_time_minutes]
Index: []

In [42]:
# Delivery Time Validation
orders_df[
    (orders_df['delivery_time_minutes'] <= 0) |
    (orders_df['delivery_time_minutes'] > 180)
]

,order_id,customer_id,restaurant_id,order_amount,order_status,payment_method,order_date,delivery_time_minutes
5,1006,106,206,950,Completed,UPI,2023-10-05,200.0
17,1017,107,201,1200,Completed,Card,2023-10-19,300.0
24,1024,104,208,760,Completed,Card,2023-10-26,0.0

Cleaning & Transformation

In [43]:
# Remove Exact Duplicates
orders_df.drop_duplicates(subset=['order_id'], inplace=True)

In [44]:
# Fix Negative or Zero Order Amount
orders_df.loc[
    orders_df['order_amount'] <= 0,
    'order_amount'
] = pd.NA
orders_df.head()

,order_id,customer_id,restaurant_id,order_amount,order_status,payment_method,order_date,delivery_time_minutes
0,1001,101,201,850.0,Completed,UPI,2023-09-10,35.0
1,1002,102,202,NaN,completed,Card,2023-09-12,40.0
2,1003,103,203,NaN,cancel,Cash,2023-09-15,NaN
3,1004,104,204,1200.0,done,UPI,2026-01-01,50.0
4,1005,105,205,650.0,Cancelled,Card,2023-10-01,20.0

In [45]:
# Add flag:
orders_df['amount_valid_flag'] = orders_df['order_amount'].notna().astype(int)

In [46]:
# Standardize order_status
orders_df['order_status'] = orders_df['order_status'].str.lower()

status_mapping = {
    'completed': 'Completed',
    'done': 'Completed',
    'cancel': 'Cancelled',
    'cancelled': 'Cancelled'
}

orders_df['order_status'] = orders_df['order_status'].map(status_mapping)
orders_df.head()

,order_id,customer_id,restaurant_id,order_amount,order_status,payment_method,order_date,delivery_time_minutes,amount_valid_flag
0,1001,101,201,850.0,Completed,UPI,2023-09-10,35.0,1
1,1002,102,202,NaN,Completed,Card,2023-09-12,40.0,0
2,1003,103,203,NaN,Cancelled,Cash,2023-09-15,NaN,0
3,1004,104,204,1200.0,Completed,UPI,2026-01-01,50.0,1
4,1005,105,205,650.0,Cancelled,Card,2023-10-01,20.0,1

In [47]:
# Clean Delivery Time
orders_df.loc[
    (orders_df['delivery_time_minutes'] <= 0) |
    (orders_df['delivery_time_minutes'] > 180),
    'delivery_time_minutes'
] = pd.NA

orders_df.head()

,order_id,customer_id,restaurant_id,order_amount,order_status,payment_method,order_date,delivery_time_minutes,amount_valid_flag
0,1001,101,201,850.0,Completed,UPI,2023-09-10,35.0,1
1,1002,102,202,NaN,Completed,Card,2023-09-12,40.0,0
2,1003,103,203,NaN,Cancelled,Cash,2023-09-15,NaN,0
3,1004,104,204,1200.0,Completed,UPI,2026-01-01,50.0,1
4,1005,105,205,650.0,Cancelled,Card,2023-10-01,20.0,1

Create Business Columns (Transformation Layer)

In [48]:
# Year-Month Column
orders_df['year_month'] = orders_df['order_date'].dt.to_period('M')

# Delay Indicator
orders_df['is_delayed'] = (orders_df['delivery_time_minutes'] > 45).astype(int)

# Cancellation Flag
orders_df['is_cancelled'] = (orders_df['order_status'] == 'Cancelled').astype(int)

In [49]:
# Store Clean Data in Silver
silver_path = Path("data/fd/silver")
silver_path.mkdir(parents=True, exist_ok=True)

orders_df.to_csv(
    silver_path / "orders_clean.csv",
    index=False
)

#### Gold Layer Analytics

Load Silver Data

In [50]:
import pandas as pd

customers_df = pd.read_csv("data/fd/silver/customer_clean.csv")
restaurants_df = pd.read_csv("data/fd/silver/restaurant_clean.csv")
orders_df = pd.read_csv("data/fd/silver/orders_clean.csv")

In [51]:
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   order_id               27 non-null     int64
 1   customer_id            27 non-null     int64
 2   restaurant_id          27 non-null     int64
 3   order_amount           22 non-null     float64
 4   order_status           25 non-null     object
 5   payment_method         27 non-null     object
 6   order_date             27 non-null     object
 7   delivery_time_minutes  22 non-null     float64
 8   amount_valid_flag      27 non-null     int64
 9   year_month             27 non-null     object
 10  is_delayed             27 non-null     int64
 11  is_cancelled           27 non-null     int64
dtypes: float64(2), int64(6), object(4)
memory usage: 2.7+ KB

In [52]:
orders_df.head()

,order_id,customer_id,restaurant_id,order_amount,order_status,payment_method,order_date,delivery_time_minutes,amount_valid_flag,year_month,is_delayed,is_cancelled
0,1001,101,201,850.0,Completed,UPI,2023-09-10,35.0,1,2023-09,0,0
1,1002,102,202,NaN,Completed,Card,2023-09-12,40.0,0,2023-09,0,0
2,1003,103,203,NaN,Cancelled,Cash,2023-09-15,NaN,0,2023-09,0,1
3,1004,104,204,1200.0,Completed,UPI,2026-01-01,50.0,1,2026-01,1,0
4,1005,105,205,650.0,Cancelled,Card,2023-10-01,20.0,1,2023-10,0,1

In [53]:
# Make sure dates are proper:
orders_df['order_date'] = pd.to_datetime(orders_df['order_date'])

In [54]:
# Join All Datasets (Gold Layer)

gold_df = (
    orders_df
    .merge(customers_df, on='customer_id', how='left')
    .merge(restaurants_df, on='restaurant_id', how='left')
)

In [55]:
gold_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 25 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   order_id               27 non-null     int64
 1   customer_id            27 non-null     int64
 2   restaurant_id          27 non-null     int64
 3   order_amount           22 non-null     float64
 4   order_status           25 non-null     object
 5   payment_method         27 non-null     object
 6   order_date             27 non-null     datetime64[ns]
 7   delivery_time_minutes  22 non-null     float64
 8   amount_valid_flag      27 non-null     int64
 9   year_month             27 non-null     object
 10  is_delayed             27 non-null     int64
 11  is_cancelled           27 non-null     int64
 12  first_name             24 non-null     object
 13  last_name              24 non-null     object
 14  email                  21 non-null     object
 15  phone                  16 non-null     float64
 16  city_x                 22 non-null     object
 17  registration_date      21 non-null     object
 18  status                 24 non-null     object
 19  restaurant_name        24 non-null     object
 20  city_y                 20 non-null     object
 21  cuisine_type           24 non-null     object
 22  rating                 14 non-null     float64
 23  is_active              24 non-null     object
 24  opening_date           24 non-null     object
dtypes: datetime64[ns](1), float64(4), int64(6), object(14)
memory usage: 5.4+ KB

#### KPI ANALYSIS

In [56]:
# Total Revenue
# Exclude cancelled orders & invalid amounts:

total_revenue = gold_df[
    (gold_df['is_cancelled'] == 0) &
    (gold_df['amount_valid_flag'] == 1)
]['order_amount'].sum()

print("Total Revenue:", total_revenue)

Total Revenue: 15280.0

In [57]:
# Monthly Revenue Trend
monthly_revenue = (
    gold_df[
        (gold_df['is_cancelled'] == 0) &
        (gold_df['amount_valid_flag'] == 1)
    ]
    .groupby(gold_df['order_date'].dt.to_period('M'))['order_amount']
    .sum()
    .reset_index()
)

print(monthly_revenue)

  order_date  order_amount
0    2023-09         850.0
1    2023-10       12360.0
2    2026-01        1200.0
3    2026-02         870.0

In [58]:
# Cancellation Rate (%)
total_orders = gold_df.shape[0]
cancelled_orders = gold_df['is_cancelled'].sum()

cancellation_rate = (cancelled_orders / total_orders) * 100

print("Cancellation Rate (%):", round(cancellation_rate,2))

Cancellation Rate (%): 25.93

In [59]:
# Revenue by Restaurant
restaurant_revenue = (
    gold_df[
        (gold_df['is_cancelled'] == 0) &
        (gold_df['amount_valid_flag'] == 1)
    ]
    .groupby('restaurant_name')['order_amount']
    .sum()
    .sort_values(ascending=False)
)

print(restaurant_revenue)

restaurant_name
Spice Hub          3840.0
123Food            2290.0
Urban Grill        1970.0
Quick Eat          1870.0
The Curry House    1590.0
Food Corner        1190.0
Tasty Bites         780.0
Name: order_amount, dtype: float64

In [60]:
# Top 5 Customers by Spend
top_customers = (
    gold_df[
        (gold_df['is_cancelled'] == 0)
    ]
    .groupby(['customer_id','first_name'])['order_amount']
    .sum()
    .sort_values(ascending=False)
    .head(5)
)

print(top_customers)

customer_id  first_name
105          Raj           2210.0
104          Sneha         1960.0
101          Rahul         1740.0
106          Anjali        1380.0
110          Unknown       1330.0
Name: order_amount, dtype: float64

#### DWH Schema Structure

```
food_delivery_dwh
    DimCustomer
    DimRestaurant
    DimDate
    FactOrders
```

In [61]:
from sqlalchemy import create_engine

dwh_con = create_engine("mysql+mysqlconnector://root:password@localhost/food_delivery_dwh")

DimCustomer

In [63]:
# Load Data from Panda
dim_customer = customers_df[[
    'customer_id','first_name','last_name','city','status'
]].drop_duplicates()

dim_customer

   customer_id first_name last_name       city    status
0          101      Rahul    Sharma     Mumbai    ACTIVE
1          102      Priya     Verma      Delhi    ACTIVE
2          103       Amit   Unknown       Pune    ACTIVE
3          104      Sneha  Kulkarni  Bangalore    ACTIVE
4          105        Raj     Patel  Ahmedabad  INACTIVE
5          106     Anjali     Mehta     Mumbai    ACTIVE
6          108      Karan     Singh        NaN    ACTIVE
7          109      Meera       Rao       Pune    ACTIVE
8          110    Unknown    Kapoor      Delhi    ACTIVE

In [64]:
dim_customer.to_sql(
    'dimcustomer',
    con=dwh_con,
    if_exists='append',
    index=False
)

9

In [65]:
pd.read_sql("SELECT * FROM dimcustomer", dwh_con)

   CustomerKey  customer_id first_name last_name       city    status
0            1          101      Rahul    Sharma     Mumbai    ACTIVE
1            2          102      Priya     Verma      Delhi    ACTIVE
2            3          103       Amit   Unknown       Pune    ACTIVE
3            4          104      Sneha  Kulkarni  Bangalore    ACTIVE
4            5          105        Raj     Patel  Ahmedabad  INACTIVE
5            6          106     Anjali     Mehta     Mumbai    ACTIVE
6            7          108      Karan     Singh       None    ACTIVE
7            8          109      Meera       Rao       Pune    ACTIVE
8            9          110    Unknown    Kapoor      Delhi    ACTIVE

DimRestaurant

In [67]:
dim_restaurant = restaurants_df[[
    'restaurant_id',
    'restaurant_name',
    'city',
    'cuisine_type',
    'rating',
]].drop_duplicates()

In [68]:
dim_restaurant.to_sql(
    'DimRestaurant',
    con=dwh_con,
    if_exists='append',
    index=False
)

print("DimRestaurant loaded successfully!")

DimRestaurant loaded successfully!

C:\Users\PankajChoudhary\AppData\Local\Temp\ipykernel_20968\2603387639.py:1: UserWarning: The provided table name 'DimRestaurant' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  dim_restaurant.to_sql(

In [69]:
pd.read_sql("SELECT * FROM dimrestaurant", dwh_con)

,RestaurantKey,restaurant_id,restaurant_name,city,cuisine_type,rating,is_active_flag
0,1,201,Spice Hub,Mumbai,Indian,4.5,None
1,2,202,Tasty Bites,Delhi,Italian,NaN,None
2,3,203,Food Corner,None,Chinese,3.8,None
3,4,205,Quick Eat,Pune,Unknown,NaN,None
4,5,206,Urban Grill,Bangalore,Continental,4.0,None
5,6,207,The Curry House,Delhi,Indian,NaN,None
6,7,208,123Food,Pune,Fastfood,4.2,None

Load DimDate

In [70]:
orders_df['DateKey'] = orders_df['order_date'].dt.strftime('%Y%m%d').astype(int)

dim_date = orders_df[['DateKey','order_date']].drop_duplicates()

dim_date['Year'] = dim_date['order_date'].dt.year
dim_date['Quarter'] = dim_date['order_date'].dt.quarter
dim_date['Month'] = dim_date['order_date'].dt.month
dim_date['MonthName'] = dim_date['order_date'].dt.month_name()
dim_date['Day'] = dim_date['order_date'].dt.day

dim_date.columns = [
    'DateKey','FullDate','Year','Quarter',
    'Month','MonthName','Day'
]

dim_date.head()

    DateKey   FullDate  Year  Quarter  Month  MonthName  Day
0  20230910 2023-09-10  2023        3      9  September   10
1  20230912 2023-09-12  2023        3      9  September   12
2  20230915 2023-09-15  2023        3      9  September   15
3  20260101 2026-01-01  2026        1      1    January    1
4  20231001 2023-10-01  2023        4     10    October    1

In [71]:
dim_date.to_sql(
    'dimdate',
    con=dwh_con,
    if_exists='append',
    index=False
)

print("DimDate loaded successfully!")

DimDate loaded successfully!

In [72]:
pd.read_sql("SELECT * FROM dimdate", dwh_con).head()

    DateKey    FullDate  Year  Quarter  Month  MonthName  Day
0  20230910  2023-09-10  2023        3      9  September   10
1  20230912  2023-09-12  2023        3      9  September   12
2  20230915  2023-09-15  2023        3      9  September   15
3  20231001  2023-10-01  2023        4     10    October    1
4  20231005  2023-10-05  2023        4     10    October    5

Prepare FactOrders

In [73]:
dim_customer_db = pd.read_sql("SELECT CustomerKey, customer_id FROM DimCustomer", dwh_con)
dim_restaurant_db = pd.read_sql("SELECT RestaurantKey, restaurant_id FROM DimRestaurant", dwh_con)

In [74]:
# Merge to Get Surrogate Keys

fact_df = orders_df.merge(dim_customer_db, on='customer_id', how='left')
fact_df = fact_df.merge(dim_restaurant_db, on='restaurant_id',  how='left')

In [149]:
fact_df['DateKey'] = fact_df['order_date'].dt.strftime('%Y%m%d').astype(int)

In [75]:
print("Missing CustomerKey:", fact_df['CustomerKey'].isna().sum())
print("Missing RestaurantKey:", fact_df['RestaurantKey'].isna().sum())

Missing CustomerKey: 3
Missing RestaurantKey: 3

In [76]:
valid_fact_df = fact_df[
    (fact_df['CustomerKey'].notna()) &
    (fact_df['RestaurantKey'].notna())
]

invalid_fact_df = fact_df[
    (fact_df['CustomerKey'].isna()) |
    (fact_df['RestaurantKey'].isna())
]

print("Total Orders:", len(fact_df))
print("Valid Orders:", len(valid_fact_df))
print("Rejected Orders:", len(invalid_fact_df))

Total Orders: 27
Valid Orders: 21
Rejected Orders: 6

In [77]:
print(invalid_fact_df[['order_id','customer_id','restaurant_id']])

    order_id  customer_id  restaurant_id
3       1004          104            204
6       1007          107            207
11      1012          102            204
16      1017          107            201
19      1020          110            204
26      1027          107            203

In [78]:
# Load ONLY Valid Records to Fact Table
valid_fact_df = valid_fact_df[[
    'order_id',
    'CustomerKey',
    'RestaurantKey',
    'DateKey',
    'order_amount',
    'delivery_time_minutes',
    'is_cancelled',
    'is_delayed'
]]

valid_fact_df.to_sql(
    'factorders',
    con=dwh_con,
    if_exists='append',
    index=False
)

print("Valid FactOrders loaded successfully!")

Valid FactOrders loaded successfully!

In [79]:
pd.read_sql("SELECT * FROM factorders", dwh_con).head()

,OrderKey,order_id,CustomerKey,RestaurantKey,DateKey,order_amount,delivery_time_minutes,is_cancelled,is_delayed
0,1,1001,1,1,20230910,850.0,35.0,0,0
1,2,1002,2,2,20230912,NaN,40.0,0,0
2,3,1003,3,3,20230915,NaN,NaN,1,0
3,4,1005,5,4,20231001,650.0,20.0,1,0
4,5,1006,6,5,20231005,950.0,NaN,0,0

In [80]:
# Store Rejected Records

reject_path = Path("data/fd/recjects")
reject_path.mkdir(parents=True, exist_ok=True)

invalid_fact_df.to_csv(
    reject_path / "fact_rejected_records.csv",
    index=False
)